// Создать массив и сортировать его по возрастанию
void ShowArray(int[]array)
{
    System.Console.WriteLine($"{String.Join(", ", array)}");
}

int[] collectin = {2, 34, 6, 09, 5, 6, 3, 1, 9};
ShowArray(collectin);

